#+Title:	Requirements for mytimeout
#+author:	Neil Cherry <ncherry@linuxha.com>
#+date:		Jan. 13, 2021

* Current results

#+Name: npm run test
#+begin_src bash :results drawer
(
echo -e "###\n### $(date)\n###"
cd ~/dev/git/mytimeout
npm run test
echo -e "###\n### Returned: $?\n###"
true
) 2>&1 
#+end_src

#+RESULTS: npm run test
:results:
###
### Sun 27 Feb 2022 10:03:37 AM EST
###

> node-red-contrib-mytimeout@3.2.3 pretest
> eslint *.js


> node-red-contrib-mytimeout@3.2.3 test
> mocha --exit "test/*_spec.js"



  * 0000 - Basic mytimeout Node
    ✓ TC00 - should be loaded
    ✓ TC01 - timed on, minimal time (2/1), TX on (4009ms)
    ✓ TC02 - stop, should be timed, TX stop (2006ms)
    ✓ TC03 - cancel, should be timed, TX cancel (2006ms)
    ✓ TC04 - Test with empty payload "" and no warning msg, TX "" (4008ms)
    ✓ TC05 - Should turn off, Tx off (2007ms)
    ✓ TC06 - Should turn off, Tx 0 (2007ms)
    ✓ TC06 - Should turn off, Tx "0" (4006ms)
    ✓ TC07 - Should on with no warning (warning value as an integer), Tx on (4008ms)
    ✓ TC11 - Should turn on/on, Tx on (7008ms)
    ✓ TC11a- Should turn on/'' with warning, Tx on  (7010ms)
    ✓ TC11b- Should turn on/'' with no warning, Tx on  (7010ms)
    ✓ TC15 - Should turn on then off, Tx on (3011ms)
    ✓ TC16 - Should turn on then stop, Tx on (3008ms)
    ✓ TC19 - Should turn on then cancel, Tx on (3012ms)
    ✓ TCxx - Should turn on 2 Tx 1
    ✓ TC20?- Should turn on 2, complex Tx 1 (4008ms)
    ✓ TC21 - Should turn on, Tx "0" (4007ms)
    ✓ TC21a- Should turn normal on/off, Tx on w/floats (5012ms)
    ✓ TC23 - Should turn on/on (2nd no payload), Tx on - TC xx (13020ms)
    ✓ TC24 - Should turn on with junk, Tx junk (5010ms)
    ✓ TC25 - Should turn on with junk with no outwarning (''), Tx junk (5010ms)
    ✓ TC26 - Should turn on with junk with outwarning not defined & warning (0), Tx junk (5011ms)
    ✓ TC27 - Should turn on with junk with outwarning & warning defined, Tx junk & warning 0 (5013ms)

  * 0010 - Complex on test case for mytimeout Node
    ✓ TC01 - Dummy, should be true

  * 0020 - Complex off test case for mytimeout Node
    ✓ TC01 - Dummy, should be true

  * 0030 - Complex pause test case for mytimeout Node
Sent in n1 {"payload":"on","extra":"extra1","testCase":"0001","t":1645974319005}
Sent in n3 {"payload":"pause","extra":"extra1","testCase":"0001","t":1645974320007}
Sent in TO {"payload":"suspend","extra":"extra1","testCase":"0001","t":1645974321006}
    ✓ TC01 - Should turn on/pause/suspend, Tx on/pause/suspend (13011ms)
Sent in n1 {"payload":"on","extra":"extra1","testCase":"0002","t":1645974332025}
Sent in n3 {"payload":"pause","extra":"extra1","testCase":"0002","t":1645974333026}
Sent in TO {"payload":"continue","extra":"extra1","testCase":"0002","t":1645974334026}
    ✓ TC02 - Should turn on/pause/continue, Tx on/pause/continue (13006ms)
Sent in n1 {"payload":"on","extra":"extra1","testCase":"0003","t":1645974345043}
Sent in n3 {"payload":"pause","extra":"extra1","testCase":"0003","t":1645974346045}
Sent in TO {"payload":"pause","extra":"extra1","testCase":"0003","t":1645974347045}
Cmnds Err: AssertionError: expected Array [
  Object {
    payload: 'on',
    extra: 'extra1',
    testCase: '0003',
    t: 1645974345044,
    _msgid: '29dfee28.84e812'
  },
  Object {
    payload: 'pause',
    extra: 'extra1',
    testCase: '0003',
    t: 1645974346046,
    _msgid: '3131e5ba.1825ba'
  }
] to have property length of 4 (got 2) (9/_)
Cmnds Err: AssertionError: expected Array [
  Object {
    payload: 'on',
    extra: 'extra1',
    testCase: '0003',
    t: 1645974345044,
    _msgid: '29dfee28.84e812'
  },
  Object {
    payload: 'pause',
    extra: 'extra1',
    testCase: '0003',
    t: 1645974346046,
    _msgid: '3131e5ba.1825ba'
  }
] to have property length of 4 (got 2) (9/_)
Sent:  [
  {
    "payload": "on",
    "extra": "extra1",
    "testCase": "0003",
    "t": 1645974345044,
    "_msgid": "29dfee28.84e812"
  },
  {
    "payload": "pause",
    "extra": "extra1",
    "testCase": "0003",
    "t": 1645974346046,
    "_msgid": "3131e5ba.1825ba"
  },
  {
    "payload": "pause",
    "extra": "extra1",
    "testCase": "0003",
    "t": 1645974347045,
    "_msgid": "2c62f62e.988faa"
  }
]
Cmnds: [
  {
    "payload": "on",
    "extra": "extra1",
    "testCase": "0003",
    "t": 1645974345044,
    "_msgid": "29dfee28.84e812"
  },
  {
    "payload": "pause",
    "extra": "extra1",
    "testCase": "0003",
    "t": 1645974346046,
    "_msgid": "3131e5ba.1825ba"
  }
]
Ticks: [
  {
    "payload": 9,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "e6244f2e.e83b7",
    "t": 1645974345044
  },
  {
    "payload": 8,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "bb17789.89b1088",
    "t": 1645974346045
  },
  {
    "payload": 7,
    "state": 3,
    "flag": "pause",
    "_msgid": "3131e5ba.1825ba",
    "t": 1645974346046
  }
]
    1) TC03 - Should turn on/pause/pause, Tx on/pause x2
Sent in n1 {"payload":"on","extra":"extra1","testCase":"0004","t":1645974358072}
Sent in n3 {"payload":"suspend","extra":"extra1","testCase":"0004","t":1645974359074}
Sent in TO {"payload":"suspend","extra":"extra1","testCase":"0004","t":1645974360074}
Ticks Err: AssertionError: expected Array [
  Object {
    payload: 9,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '28c7fac2.bd2036',
    t: 1645974358073
  },
  Object {
    payload: 8,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'f011688.132cc98',
    t: 1645974359074
  },
  Object {
    payload: 7,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'e7dfcf2c.32ae8',
    t: 1645974360075
  },
  Object {
    payload: 6,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '84984269.e5cee',
    t: 1645974361076
  },
  Object {
    payload: 5,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '8bae71d2.47ebb',
    t: 1645974362077
  },
  Object {
    payload: 4,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '7b62c4e9.2e7f0c',
    t: 1645974363078
  },
  Object {
    payload: 3,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'd9f47852.9775a8',
    t: 1645974364080
  },
  Object {
    payload: 2,
    state: 2,
    flag: 'warn >= ticks',
    _msgid: 'c31cd6c3.515928',
    t: 1645974365081
  },
  Object {
    payload: 1,
    state: 2,
    flag: 'warn >= ticks',
    _msgid: '29e14266.e9e21e',
    t: 1645974366082
  },
  Object {
    payload: 0,
    state: 0,
    flag: 'off',
    _msgid: '57f2e6fe.4f72d8',
    t: 1645974367083
  }
] to have property length of 11 (got 10)
Sent:  [
  {
    "payload": "on",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974358073,
    "_msgid": "6457dcf2.a52ba4"
  },
  {
    "payload": "pause",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974359074,
    "_msgid": "26205604.a732ea"
  },
  {
    "payload": "off",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974367083,
    "_msgid": "57f2e6fe.4f72d8"
  }
]
Cmnds: [
  {
    "payload": "on",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974358073,
    "_msgid": "6457dcf2.a52ba4"
  },
  {
    "payload": "pause",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974359074,
    "_msgid": "26205604.a732ea"
  },
  {
    "payload": "warning",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974365081,
    "_msgid": "57f2e6fe.4f72d8"
  },
  {
    "payload": "off",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974367083,
    "_msgid": "57f2e6fe.4f72d8"
  }
]
Ticks: [
  {
    "payload": 9,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "28c7fac2.bd2036",
    "t": 1645974358073
  },
  {
    "payload": 8,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "f011688.132cc98",
    "t": 1645974359074
  },
  {
    "payload": 7,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "e7dfcf2c.32ae8",
    "t": 1645974360075
  },
  {
    "payload": 6,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "84984269.e5cee",
    "t": 1645974361076
  },
  {
    "payload": 5,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "8bae71d2.47ebb",
    "t": 1645974362077
  },
  {
    "payload": 4,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "7b62c4e9.2e7f0c",
    "t": 1645974363078
  },
  {
    "payload": 3,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "d9f47852.9775a8",
    "t": 1645974364080
  },
  {
    "payload": 2,
    "state": 2,
    "flag": "warn >= ticks",
    "_msgid": "c31cd6c3.515928",
    "t": 1645974365081
  },
  {
    "payload": 1,
    "state": 2,
    "flag": "warn >= ticks",
    "_msgid": "29e14266.e9e21e",
    "t": 1645974366082
  },
  {
    "payload": 0,
    "state": 0,
    "flag": "off",
    "_msgid": "57f2e6fe.4f72d8",
    "t": 1645974367083
  }
]
Cmnds Err: AssertionError: expected Array [
  Object {
    payload: 9,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '28c7fac2.bd2036',
    t: 1645974358073
  },
  Object {
    payload: 8,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'f011688.132cc98',
    t: 1645974359074
  },
  Object {
    payload: 7,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'e7dfcf2c.32ae8',
    t: 1645974360075
  },
  Object {
    payload: 6,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '84984269.e5cee',
    t: 1645974361076
  },
  Object {
    payload: 5,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '8bae71d2.47ebb',
    t: 1645974362077
  },
  Object {
    payload: 4,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '7b62c4e9.2e7f0c',
    t: 1645974363078
  },
  Object {
    payload: 3,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'd9f47852.9775a8',
    t: 1645974364080
  },
  Object {
    payload: 2,
    state: 2,
    flag: 'warn >= ticks',
    _msgid: 'c31cd6c3.515928',
    t: 1645974365081
  },
  Object {
    payload: 1,
    state: 2,
    flag: 'warn >= ticks',
    _msgid: '29e14266.e9e21e',
    t: 1645974366082
  },
  Object {
    payload: 0,
    state: 0,
    flag: 'off',
    _msgid: '57f2e6fe.4f72d8',
    t: 1645974367083
  }
] to have property length of 11 (got 10) (9/_)
Sent:  [
  {
    "payload": "on",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974358073,
    "_msgid": "6457dcf2.a52ba4"
  },
  {
    "payload": "pause",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974359074,
    "_msgid": "26205604.a732ea"
  },
  {
    "payload": "off",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974367083,
    "_msgid": "57f2e6fe.4f72d8"
  }
]
Cmnds: [
  {
    "payload": "on",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974358073,
    "_msgid": "6457dcf2.a52ba4"
  },
  {
    "payload": "pause",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974359074,
    "_msgid": "26205604.a732ea"
  },
  {
    "payload": "warning",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974365081,
    "_msgid": "57f2e6fe.4f72d8"
  },
  {
    "payload": "off",
    "extra": "extra1",
    "testCase": "0004",
    "t": 1645974367083,
    "_msgid": "57f2e6fe.4f72d8"
  }
]
Ticks: [
  {
    "payload": 9,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "28c7fac2.bd2036",
    "t": 1645974358073
  },
  {
    "payload": 8,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "f011688.132cc98",
    "t": 1645974359074
  },
  {
    "payload": 7,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "e7dfcf2c.32ae8",
    "t": 1645974360075
  },
  {
    "payload": 6,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "84984269.e5cee",
    "t": 1645974361076
  },
  {
    "payload": 5,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "8bae71d2.47ebb",
    "t": 1645974362077
  },
  {
    "payload": 4,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "7b62c4e9.2e7f0c",
    "t": 1645974363078
  },
  {
    "payload": 3,
    "state": 1,
    "flag": "ticks > 0",
    "_msgid": "d9f47852.9775a8",
    "t": 1645974364080
  },
  {
    "payload": 2,
    "state": 2,
    "flag": "warn >= ticks",
    "_msgid": "c31cd6c3.515928",
    "t": 1645974365081
  },
  {
    "payload": 1,
    "state": 2,
    "flag": "warn >= ticks",
    "_msgid": "29e14266.e9e21e",
    "t": 1645974366082
  },
  {
    "payload": 0,
    "state": 0,
    "flag": "off",
    "_msgid": "57f2e6fe.4f72d8",
    "t": 1645974367083
  }
]
    2) TC04 - Should turn on/suspend/suspend, Tx on/suspend x2

  * 0040 - Complex no on test case for mytimeout Node (Dummy - WIP)
    ✓ TC01 - Dummy, should be true

  * 0040 - Complex topic test cases for mytimeout Node (Dummy - WIP)
    ✓ TC01 - Dummy, should be true

  * 9000 -mytimeout Node/MQTT flow test
    ✓ TC00 - should be loaded

  * 9990 - T - timeout test
    ✓ TC01 - pass timeout test (4008ms)
    ✓ TC03 - fail timeout test

  * 9999 - X Promise tests
    ✓ TC01 - Dummy, should be true
    ✓ TC02 - Dummy, should be false
    ✓ TC03 - should fail and I should catch it
    ✓ TC04 - timed on, minimal time (2/1), TX on (4006ms)


  37 passing (3m)
  2 failing

  1) * 0030 - Complex pause test case for mytimeout Node
       TC03 - Should turn on/pause/pause, Tx on/pause x2:
     AssertionError: expected Array [
  Object {
    payload: 'on',
    extra: 'extra1',
    testCase: '0003',
    t: 1645974345044,
    _msgid: '29dfee28.84e812'
  },
  Object {
    payload: 'pause',
    extra: 'extra1',
    testCase: '0003',
    t: 1645974346046,
    _msgid: '3131e5ba.1825ba'
  }
] to have property length of 4 (got 2)
      at Assertion.fail (node_modules/should/cjs/should.js:275:17)
      at Assertion.value (node_modules/should/cjs/should.js:356:19)
      at Timeout._onTimeout (test/0030_pause_spec.js:517:31)
      at listOnTimeout (internal/timers.js:554:17)
      at processTimers (internal/timers.js:497:7)

  2) * 0030 - Complex pause test case for mytimeout Node
       TC04 - Should turn on/suspend/suspend, Tx on/suspend x2:
     AssertionError: expected Array [
  Object {
    payload: 9,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '28c7fac2.bd2036',
    t: 1645974358073
  },
  Object {
    payload: 8,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'f011688.132cc98',
    t: 1645974359074
  },
  Object {
    payload: 7,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'e7dfcf2c.32ae8',
    t: 1645974360075
  },
  Object {
    payload: 6,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '84984269.e5cee',
    t: 1645974361076
  },
  Object {
    payload: 5,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '8bae71d2.47ebb',
    t: 1645974362077
  },
  Object {
    payload: 4,
    state: 1,
    flag: 'ticks > 0',
    _msgid: '7b62c4e9.2e7f0c',
    t: 1645974363078
  },
  Object {
    payload: 3,
    state: 1,
    flag: 'ticks > 0',
    _msgid: 'd9f47852.9775a8',
    t: 1645974364080
  },
  Object {
    payload: 2,
    state: 2,
    flag: 'warn >= ticks',
    _msgid: 'c31cd6c3.515928',
    t: 1645974365081
  },
  Object {
    payload: 1,
    state: 2,
    flag: 'warn >= ticks',
    _msgid: '29e14266.e9e21e',
    t: 1645974366082
  },
  Object {
    payload: 0,
    state: 0,
    flag: 'off',
    _msgid: '57f2e6fe.4f72d8',
    t: 1645974367083
  }
] to have property length of 11 (got 10)
      at Assertion.fail (node_modules/should/cjs/should.js:275:17)
      at Assertion.value (node_modules/should/cjs/should.js:356:19)
      at Timeout._onTimeout (test/0030_pause_spec.js:727:31)
      at listOnTimeout (internal/timers.js:554:17)
      at processTimers (internal/timers.js:497:7)



###
### Returned: 2
###
:end:

